Autodesk.Revit.DB.Structure.RebarShapeVertex.SetConstraints(System.Collections.Generic.IList{Autodesk.Revit.DB.Structure.RebarShapeConstraint})
Assign a new list of constraints to this vertex.
Remarks:
Any existing constraints are discarded. The new constraints replace them.
Any parameters driving the constraints must already be added
with RebarShapeDefinition.AddParameter().
The allowable constraint types are:
RebarShapeConstraintRadiusRebarShapeConstraintArcLength
Any number of constraints may be specified. With no constraints,
the bend radius will default to the appropriate bend radius
from the RebarBarType element.
constraints:
A new list of constraints.
Throws Autodesk.Revit.Exceptions.ArgumentException:
One or more of the constraints is of a type not supported for RebarShapeVertex.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2012

Autodesk.Revit.DB.Structure.RebarShapeVertex.GetConstraints
Retrieve the list of constraints associated with this vertex.
Returns:
The list of constraints.
Since:
2012

Autodesk.Revit.DB.Structure.RebarShapeVertex.IsValidObject
Specifies whether the .NET object represents a valid Revit entity.
Remarks:
If the corresponding Revit native object is destroyed, or creation of the corresponding object is undone,
a managed API object containing it is no longer valid. API methods cannot be called on invalidated wrapper objects.
Returns:
True if the API object holds a valid Revit native object, false otherwise.
Since:
2014

Autodesk.Revit.DB.Structure.RebarShapeVertex.BendAngle
The range of permissible angles at this bend.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
When setting this property: A value passed for an enumeration argument is not a member of that enumeration
Since:
2012

Autodesk.Revit.DB.Structure.RebarShapeVertex.Turn
The sense of the turn. The Turn property must be set to Left or Right on each internal vertex
before the RebarShapeDefinitionBySegments is used.
Default is permissible for the first and last vertex, since they do not correspond to bends.
Throws Autodesk.Revit.Exceptions.ArgumentException:
When setting this property: turn must be Left or Right.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
When setting this property: A value passed for an enumeration argument is not a member of that enumeration
Since:
2012

Autodesk.Revit.DB.Structure.RebarShapeVertex
A bend between segments of a rebar shape definition.
Remarks:
A RebarShapeVertex is part of a RebarShapeDefinitionBySegments object.
There is one vertex between each pair of adjacent segments, plus one at
each end of the overall shape. The end vertices currently are ignored
by the shape definition, even if they have constraints.
A bend may have the default radius of the bar type referenced by the Rebar element,
or it may have a radius defined by a parameter.
Since:
2012